In [1]:
#PANDAS BASICS REVISION

In [3]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame(np.arange(0,10).reshape(2,5),index = ['row1','row2'],columns = ['column1','column2','column3','column4','column5'])

In [8]:
df

      column1  column2  column3  column4  column5
row1        0        1        2        3        4
row2        5        6        7        8        9

In [9]:
#accessing the elements in the dataframe using loc and iloc

In [24]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
column5    4
Name: row1, dtype: int32

In [20]:
df.iloc[:,2:4]

      column3  column4
row1        2        3
row2        7        8

In [21]:
type(df.loc['row1'])

pandas.core.series.Series

In [28]:
#Conversion into array

df.iloc[:,2:4].values

array([[2, 3],
       [7, 8]])

In [32]:
df.column2.value_counts()

6    1
1    1
Name: column2, dtype: int64

In [38]:
#to check null values present in the data set

df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
column5    0
dtype: int64

In [44]:
df.column1.unique

<bound method Series.unique of row1    0
row2    5
Name: column1, dtype: int32>

In [52]:


df1 = pd.DataFrame(np.random.rand(1,20).reshape(5,4),index='a b c d e'.split(),columns = 'w x y z'.split())

In [57]:
df1

          w         x         y         z
a  0.682997  0.951539  0.936481  0.883011
b  0.876873  0.192604  0.781289  0.476174
c  0.538634  0.731604  0.812348  0.820615
d  0.739205  0.449497  0.324926  0.227846
e  0.214044  0.332874  0.784634  0.143363

In [59]:
df1.loc[['a','b'],['x','y']]

          x         y
a  0.951539  0.936481
b  0.192604  0.781289

In [60]:
df1.iloc[2:3,1:2]

          x
c  0.731604

In [61]:
#to display only the values greater than a particular number

In [64]:
df1[df1['w']>0.6]

          w         x         y         z
a  0.682997  0.951539  0.936481  0.883011
b  0.876873  0.192604  0.781289  0.476174
d  0.739205  0.449497  0.324926  0.227846

In [72]:
#we can specify the datatype while reading data  dtype ={'a'.int}
#we can change the index index_col =1 ,reset_index

In [75]:
#to handle na values

In [76]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[3,np.nan,np.nan],
                  'C':[1,2,3]})

In [77]:
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()